{"backend": "tensorflow", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["pred_a", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"name": "densenet", "class_name": "Model", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "densenet", "input_layers": [["input_2", 0, 0]], "output_layers": [["global_average_pooling2d_1", 0, 0]], "layers": [{"name": "input_2", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "sparse": false, "name": "input_2"}}, {"name": "conv2d_1", "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "name": "conv2d_1", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 24, "kernel_constraint": null}}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "name": "conv2d_2", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 12, "kernel_constraint": null}}, {"name": "concatenate_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}], ["conv2d_2", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_1", "axis": -1, "trainable": true}}, {"name": "batch_normalization_2", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "name": "conv2d_3", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 12, "kernel_constraint": null}}, {"name": "concatenate_2", "inbound_nodes": [[["concatenate_1", 0, 0, {}], ["conv2d_3", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_2", "axis": -1, "trainable": true}}, {"name": "batch_normalization_3", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "name": "conv2d_4", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 12, "kernel_constraint": null}}, {"name": "concatenate_3", "inbound_nodes": [[["concatenate_2", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_3", "axis": -1, "trainable": true}}, {"name": "batch_normalization_4", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "name": "conv2d_5", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 12, "kernel_constraint": null}}, {"name": "concatenate_4", "inbound_nodes": [[["concatenate_3", 0, 0, {}], ["conv2d_5", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_4", "axis": -1, "trainable": true}}, {"name": "batch_normalization_5", "inbound_nodes": [[["concatenate_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"name": "conv2d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "name": "conv2d_6", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 12, "kernel_constraint": null}}, {"name": "concatenate_5", "inbound_nodes": [[["concatenate_4", 0, 0, {}], ["conv2d_6", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_5", "axis": -1, "trainable": true}}, {"name": "batch_normalization_6", "inbound_nodes": [[["concatenate_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"name": "conv2d_7", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [1, 1], "name": "conv2d_7", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 84, "kernel_constraint": null}}, {"name": "average_pooling2d_1", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_1", "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"name": "batch_normalization_7", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "name": "conv2d_8", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 12, "kernel_constraint": null}}, {"name": "concatenate_6", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_6", "axis": -1, "trainable": true}}, {"name": "batch_normalization_8", "inbound_nodes": [[["concatenate_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"name": "conv2d_9", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "name": "conv2d_9", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 12, "kernel_constraint": null}}, {"name": "concatenate_7", "inbound_nodes": [[["concatenate_6", 0, 0, {}], ["conv2d_9", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_7", "axis": -1, "trainable": true}}, {"name": "batch_normalization_9", "inbound_nodes": [[["concatenate_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_9", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "name": "conv2d_10", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 12, "kernel_constraint": null}}, {"name": "concatenate_8", "inbound_nodes": [[["concatenate_7", 0, 0, {}], ["conv2d_10", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_8", "axis": -1, "trainable": true}}, {"name": "batch_normalization_10", "inbound_nodes": [[["concatenate_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_10", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_10", "activation": "relu", "trainable": true}}, {"name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "name": "conv2d_11", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 12, "kernel_constraint": null}}, {"name": "concatenate_9", "inbound_nodes": [[["concatenate_8", 0, 0, {}], ["conv2d_11", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_9", "axis": -1, "trainable": true}}, {"name": "batch_normalization_11", "inbound_nodes": [[["concatenate_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_11", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_11", "activation": "relu", "trainable": true}}, {"name": "conv2d_12", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "name": "conv2d_12", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 12, "kernel_constraint": null}}, {"name": "concatenate_10", "inbound_nodes": [[["concatenate_9", 0, 0, {}], ["conv2d_12", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_10", "axis": -1, "trainable": true}}, {"name": "batch_normalization_12", "inbound_nodes": [[["concatenate_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_12", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_12", "activation": "relu", "trainable": true}}, {"name": "conv2d_13", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [1, 1], "name": "conv2d_13", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 144, "kernel_constraint": null}}, {"name": "average_pooling2d_2", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_2", "padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"name": "batch_normalization_13", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_13", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_13", "activation": "relu", "trainable": true}}, {"name": "conv2d_14", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "name": "conv2d_14", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 12, "kernel_constraint": null}}, {"name": "concatenate_11", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}], ["conv2d_14", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_11", "axis": -1, "trainable": true}}, {"name": "batch_normalization_14", "inbound_nodes": [[["concatenate_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_14", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_14", "activation": "relu", "trainable": true}}, {"name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "name": "conv2d_15", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 12, "kernel_constraint": null}}, {"name": "concatenate_12", "inbound_nodes": [[["concatenate_11", 0, 0, {}], ["conv2d_15", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_12", "axis": -1, "trainable": true}}, {"name": "batch_normalization_15", "inbound_nodes": [[["concatenate_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_15", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_15", "activation": "relu", "trainable": true}}, {"name": "conv2d_16", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "name": "conv2d_16", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 12, "kernel_constraint": null}}, {"name": "concatenate_13", "inbound_nodes": [[["concatenate_12", 0, 0, {}], ["conv2d_16", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_13", "axis": -1, "trainable": true}}, {"name": "batch_normalization_16", "inbound_nodes": [[["concatenate_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_16", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_16", "activation": "relu", "trainable": true}}, {"name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "name": "conv2d_17", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 12, "kernel_constraint": null}}, {"name": "concatenate_14", "inbound_nodes": [[["concatenate_13", 0, 0, {}], ["conv2d_17", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_14", "axis": -1, "trainable": true}}, {"name": "batch_normalization_17", "inbound_nodes": [[["concatenate_14", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_17", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_17", "activation": "relu", "trainable": true}}, {"name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D", "config": {"activation": "linear", "kernel_size": [3, 3], "name": "conv2d_18", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "mode": "fan_in", "scale": 2.0, "seed": null}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": false, "dilation_rate": [1, 1], "filters": 12, "kernel_constraint": null}}, {"name": "concatenate_15", "inbound_nodes": [[["concatenate_14", 0, 0, {}], ["conv2d_18", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_15", "axis": -1, "trainable": true}}, {"name": "batch_normalization_18", "inbound_nodes": [[["concatenate_15", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"epsilon": 1.1e-05, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_constraint": null, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_18", "beta_constraint": null, "gamma_regularizer": null, "trainable": true, "momentum": 0.99, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_18", "activation": "relu", "trainable": true}}, {"name": "global_average_pooling2d_1", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "data_format": "channels_last", "trainable": true}}]}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["densenet", 1, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "name": "dense_1", "use_bias": true, "kernel_constraint": null}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"name": "dropout_1", "rate": 0.2, "trainable": true}}, {"name": "feat_a", "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "name": "feat_a", "use_bias": true, "kernel_constraint": null}}, {"name": "pred_a", "class_name": "Dense", "inbound_nodes": [[["feat_a", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "name": "pred_a", "use_bias": true, "kernel_constraint": null}}]}, "keras_version": "2.0.6"}